In [1]:
import pandas as pd

In [3]:
# Leyendo el archivo csv
df_family = pd.read_csv("familia.csv")
df_family

     Nombres  Edad genero          Trabajo
0     Moises    24      M      Programador
1    Lluvia     46      F        Repostera
2     Aaron     22      M             Chef
3      Itzel    28      F          Doctora
4    Alberto    26      M     Biotecnologo
5     Junuen    27      F  Ing. Industrial
6  Francisco    20     M           Locutor

# 1 Agregar una nueva Columna

## Agragar una nueva columna con un valor

In [8]:
# Agregar una nueva columna al dartaframe
df_family['Idiomas'] = "Español"
df_family
df_family['Salario'] = 10000
df_family

     Nombres  Edad genero          Trabajo  Idiomas  Salario
0     Moises    24      M      Programador  Español    10000
1    Lluvia     46      F        Repostera  Español    10000
2     Aaron     22      M             Chef  Español    10000
3      Itzel    28      F          Doctora  Español    10000
4    Alberto    26      M     Biotecnologo  Español    10000
5     Junuen    27      F  Ing. Industrial  Español    10000
6  Francisco    20     M           Locutor  Español    10000

## 1.2 Agregar una nueva columna con un array

EL dataframe tiene 7 filas por ello tenemos que crear un array the 7 elementos

In [11]:
# Importar numpy
import numpy as np

In [13]:
# Crear un array de 7 elementos (empieza en 10,000 termina en 17,000 y avanza 1,000)
salario_num = np.arange(10000,17000,1000)

In [14]:
# Tamaño del array
len(salario_num)

7

In [15]:
# Agregar una nueva columna al dataframe con un array
df_family['Salario'] = salario_num
df_family

     Nombres  Edad genero          Trabajo  Idiomas  Salario
0     Moises    24      M      Programador  Español    10000
1    Lluvia     46      F        Repostera  Español    11000
2     Aaron     22      M             Chef  Español    12000
3      Itzel    28      F          Doctora  Español    13000
4    Alberto    26      M     Biotecnologo  Español    14000
5     Junuen    27      F  Ing. Industrial  Español    15000
6  Francisco    20     M           Locutor  Español    16000

In [18]:
# Crear numeros enteros aleatorios entre 1 y 100
salario_num_new = np.random.randint(10000,20000, size=7)

In [20]:
# El minimo valor es inclusivo y el maximo valor es exclusivo
min(salario_num_new)
max(salario_num_new)

19794

In [21]:
# Agregar una nueva columna al dataframe con un array
df_family['Salario'] = salario_num_new
df_family

     Nombres  Edad genero          Trabajo  Idiomas  Salario
0     Moises    24      M      Programador  Español    19278
1    Lluvia     46      F        Repostera  Español    12478
2     Aaron     22      M             Chef  Español    17388
3      Itzel    28      F          Doctora  Español    19794
4    Alberto    26      M     Biotecnologo  Español    14298
5     Junuen    27      F  Ing. Industrial  Español    15337
6  Francisco    20     M           Locutor  Español    11681

In [22]:
# Crear numeros decimales aleatorios entre 1 y 100
np.random.uniform(10000,20000, size=7)

array([17803.6457011 , 10219.98343464, 15449.28172524, 15640.05162761,
       11498.88110071, 13204.17114742, 12805.18362833])